{"info": "The band was originally named Pantera's Metal Magic and consisted of Vinnie Paul Abbott on drums, Dimebag Darrell Abbott (called Diamond Darrell at that time) on lead guitar, and Terry Glaze on rhythm guitar; the line-up was completed with two more unofficial members, namely vocalist Donnie Hart and bassist Tommy D. Bradford. In 1982, the band was renamed Pantera in order to shorten the name and to settle an agreement between all band members. Hart left the band because he did not agree with the band's ethics and Terry Glaze became the group's vocalist. Later, Glaze stopped playing guitar, citing how Darrell's talent seemed to make his guitar playing useless, leaving Darrell as the solo guitarist. Later that year Bradford also departed and was replaced by Rex Brown (then known as Rex Rocker). Pantera became an underground favorite, though its regional tours in this era never took them beyond Texas, Oklahoma, and Louisiana. The band began supporting fellow heavy metal/glam metal acts such as Stryper, Dokken, and Quiet Riot, who in turn promoted Pantera's debut, Metal Magic. Metal Magic was released on the band's record label of the same name in 1983 and produced by the Abbott brothers' father, Jerry Abbott (referred to as \"The Eldn\"), at Pantego Studios.[4]\r\n\r\nThe following year, Pantera released its second studio album, Projects in the Jungle. Though still very much a glam metal album, the band members crafted songs that had less overbearing melodic influences than songs from Metal Magic. Another change was Terry Glaze's name, as he was henceforth credited as \"Terrence Lee\". In addition, a music video for the album's lead track, \"All Over Tonight\", was eventually created. Projects in the Jungle was also released on the band's independent Metal Magic Records label and produced by Jerry Abbott. In 1985, Pantera again released a full-length album on Metal Magic Records, entitled I Am the Night. As with Projects in the Jungle, this album saw Pantera's sound becoming heavier (though still rooted in glam metal), and the heavy metal press took more notice of the band. Because of poor distribution, I Am the Night was a costly album to many fans. Around 25,000 copies of I Am the Night were sold. Pantera's second music video was produced for the track \"Hot and Heavy\".\r\nAnselmo’s induction (1987–1989)\r\n\r\n1986 and 1987 saw the release of several landmark thrash metal albums that would prove influential to Pantera’s developing musical style. Among the most prominent of these were Metallica’s Master of Puppets, Slayer’s Reign in Blood, Anthrax’s Among the Living and Megadeth’s Peace Sells... but Who's Buying?[5][page needed] Terrence Lee’s glam approach did not fit the band's new outlook and he and the other members parted ways, beginning a search for his replacement. Terrence then went on to form the band Lord Tracy. The band went through temporary vocalists Rick Mythiasin (also known from the bands Steel Prophet and Agent Steel), Dave Peacock and Matt L’Amour before eventually discovering New Orleans native Phil Anselmo in 1987. Anselmo had previously been the vocalist for the bands Samhain[4] (not to be confused with Glenn Danzig's band of the same name) and Razor White. Upon playing with Pantera, Anselmo immediately clicked with the other three members.\r\n\r\nMore than just the band's image was changing, however. In 1988, Pantera released its first album with Anselmo, entitled Power Metal. Power Metal was like Pantera’s previous three albums released on Metal Magic Records, but showcased a change in their sound. By far the band’s heaviest album at ", "visible": "Visible"}